package Job1;

//Даны 2 числа, определить делится ли первое число на второе без остатка

public class JobFifth {

    public static void main(String[] args) {

        int a = 3;
        int b = 4;

        if ((a % b) == 0)
            System.out.println("Shares");
            else
            System.out.println("Not divided");

    }
}
